## 🧾 Terraform Plan for `iam_audit`

> ⚠️ Review this carefully before applying changes

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.iam_audit.aws_accessanalyzer_analyzer.default[0] will be created
  + resource "aws_accessanalyzer_analyzer" "default" {
      + analyzer_name = "bluebit-prod-access-analyzer"
      + arn           = (known after apply)
      + id            = (known after apply)
      + tags          = {
          + "Compliance"  = "yes"
          + "Environment" = "production"
          + "Owner"       = "cloud-team"
          + "Project"     = "iam-security"
        }
      + tags_all      = {
          + "Compliance"  = "yes"
          + "Environment" = "production"
          + "Owner"       = "cloud-team"
          + "Project"     = "iam-security"
        }
      + type          = "ACCOUNT"
    }

  # module.iam_audit.aws_athena_database.iam_audit[0] will be created
  + resource "aws_athena_database" "iam_audit" {
      + bucket        = "bluebit-prod-iam-logs"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "iam_audit_db"
    }

  # module.iam_audit.aws_athena_workgroup.iam_audit[0] will be created
  + resource "aws_athena_workgroup" "iam_audit" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "bluebit-prod-audit-workgroup"
      + state         = "ENABLED"
      + tags_all      = (known after apply)

      + configuration {
          + enforce_workgroup_configuration    = true
          + publish_cloudwatch_metrics_enabled = true
          + requester_pays_enabled             = false

          + result_configuration {
              + output_location = "s3://bluebit-prod-iam-logs/results/"
            }
        }
    }

  # module.iam_audit.aws_config_config_rule.iam_root_access[0] will be created
  + resource "aws_config_config_rule" "iam_root_access" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "iam-root-access"
      + rule_id  = (known after apply)
      + tags_all = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "IAM_ROOT_ACCESS_KEY_CHECK"
        }
    }

  # module.iam_audit.aws_config_config_rule.iam_user_unused_credentials[0] will be created
  + resource "aws_config_config_rule" "iam_user_unused_credentials" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "iam-user-unused-credentials"
      + rule_id  = (known after apply)
      + tags_all = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "IAM_USER_UNUSED_CREDENTIALS_CHECK"
        }
    }

  # module.iam_audit.aws_iam_role.auditor[0] will be created
  + resource "aws_iam_role" "auditor" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::111122223333:role/SecurityTeam",
                              + "arn:aws:iam::444455556666:role/Auditor",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bluebit-prod-readonly-auditor"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "Compliance"  = "yes"
          + "Environment" = "production"
          + "Owner"       = "cloud-team"
          + "Project"     = "iam-security"
        }
      + tags_all              = {
          + "Compliance"  = "yes"
          + "Environment" = "production"
          + "Owner"       = "cloud-team"
          + "Project"     = "iam-security"
        }
      + unique_id             = (known after apply)
    }

  # module.iam_audit.aws_iam_role_policy_attachment.readonly[0] will be created
  + resource "aws_iam_role_policy_attachment" "readonly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = "bluebit-prod-readonly-auditor"
    }

  # module.iam_audit.aws_s3_bucket.iam_logs[0] will be created
  + resource "aws_s3_bucket" "iam_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "bluebit-prod-iam-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Compliance"  = "yes"
          + "Environment" = "production"
          + "Owner"       = "cloud-team"
          + "Project"     = "iam-security"
        }
      + tags_all                    = {
          + "Compliance"  = "yes"
          + "Environment" = "production"
          + "Owner"       = "cloud-team"
          + "Project"     = "iam-security"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.iam_audit.aws_s3_bucket_public_access_block.iam_logs[0] will be created
  + resource "aws_s3_bucket_public_access_block" "iam_logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.iam_audit_basic.aws_accessanalyzer_analyzer.default[0] will be created
  + resource "aws_accessanalyzer_analyzer" "default" {
      + analyzer_name = "bluebit-basic-access-analyzer"
      + arn           = (known after apply)
      + id            = (known after apply)
      + tags          = {
          + "Environment" = "dev"
          + "Owner"       = "bluebit"
        }
      + tags_all      = {
          + "Environment" = "dev"
          + "Owner"       = "bluebit"
        }
      + type          = "ACCOUNT"
    }

  # module.iam_audit_basic.aws_config_config_rule.iam_root_access[0] will be created
  + resource "aws_config_config_rule" "iam_root_access" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "iam-root-access"
      + rule_id  = (known after apply)
      + tags_all = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "IAM_ROOT_ACCESS_KEY_CHECK"
        }
    }

  # module.iam_audit_basic.aws_config_config_rule.iam_user_unused_credentials[0] will be created
  + resource "aws_config_config_rule" "iam_user_unused_credentials" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "iam-user-unused-credentials"
      + rule_id  = (known after apply)
      + tags_all = (known after apply)

      + source {
          + owner             = "AWS"
          + source_identifier = "IAM_USER_UNUSED_CREDENTIALS_CHECK"
        }
    }

  # module.iam_audit_basic.aws_iam_role.auditor[0] will be created
  + resource "aws_iam_role" "auditor" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = [
                              + "arn:aws:iam::123456789012:role/SecurityAuditor",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bluebit-basic-readonly-auditor"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "Owner"       = "bluebit"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Owner"       = "bluebit"
        }
      + unique_id             = (known after apply)
    }

  # module.iam_audit_basic.aws_iam_role_policy_attachment.readonly[0] will be created
  + resource "aws_iam_role_policy_attachment" "readonly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = "bluebit-basic-readonly-auditor"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->